[
  {
    "title": "The Pragmatic Programmer",
    "author": "Andrew Hunt, David Thomas",
    "isbn": "9780135957059",
    "price": 45.50,
    "cost": 22.00,
    "stock": 15,
    "category": "Software Development",
    "location": "A1",
    "publisher": "Addison-Wesley Professional",
    "description": "A seminal work in the field of software engineering, 'The Pragmatic Programmer' transcends specific languages or methodologies to offer a holistic philosophy of software development. It provides practical advice on a wide range of topics, from personal responsibility and career development to architectural techniques for creating flexible, adaptable, and maintainable code. The authors present a collection of tips and best practices, such as 'Don't Repeat Yourself' (DRY) and 'Prototype to Learn,' which have become foundational principles in modern development. This book is an essential guide for both new and experienced developers looking to cultivate a professional, pragmatic, and effective approach to their craft.",
    "coverImage": "9780135957059.jpg"
  },
  {
    "title": "Clean Code",
    "author": "Robert C. Martin",
    "isbn": "9780132350884",
    "price": 35.99,
    "cost": 18.50,
    "stock": 8,
    "category": "Software Development",
    "location": "A1",
    "publisher": "Prentice Hall",
    "description": "Authored by the renowned software expert Robert C. Martin, 'Clean Code' is a powerful guide to the principles of writing readable, understandable, and maintainable code. The book is divided into three parts: the first describes the principles, patterns, and practices of writing clean code; the second consists of several case studies of increasing complexity, where code is refactored into a cleaner state; and the third is a single chapter containing a list of heuristics and 'smells' gathered while creating the case studies. It argues that even bad code can function, but if it isn't clean, it can bring a development organization to its knees.",
    "coverImage": "9780132350884.jpg"
  },
  {
    "title": "Eloquent JavaScript",
    "author": "Marijn Haverbeke",
    "isbn": "9781593279509",
    "price": 39.95,
    "cost": 20.00,
    "stock": 20,
    "category": "Software Development",
    "location": "A1",
    "publisher": "No Starch Press",
    "description": "A modern classic, 'Eloquent JavaScript' dives deep into the JavaScript language to show you how to write beautiful, effective code. Author Marijn Haverbeke immerses you in the language with a lively and engaging narrative, starting with the basics of programming and moving on to more complex topics like object-oriented programming and functional programming. The book is renowned for its clarity, depth, and practical, hands-on projects that include building an artificial life simulation, a platform game, and a skill-sharing website. It's an indispensable resource for anyone looking to truly understand and master the art of programming in JavaScript.",
    "coverImage": "9781593279509.jpg"
  },
  {
    "title": "Head First Design Patterns",
    "author": "Eric Freeman, Elisabeth Robson",
    "isbn": "9780596007126",
    "price": 59.99,
    "cost": 31.00,
    "stock": 11,
    "category": "Software Development",
    "location": "A1",
    "publisher": "O'Reilly Media",
    "description": "Breaking the mold of traditional, text-heavy programming books, 'Head First Design Patterns' uses a visually rich format to teach you the fundamentals of software design patterns. Based on the latest research in cognitive science and learning theory, the book employs a brain-friendly approach with puzzles, strong visuals, and engaging examples to help you learn and retain key concepts. It covers foundational patterns like Strategy, Observer, Decorator, and Factory, showing you how they solve common design problems. This book is perfect for developers who want to learn how to create flexible, reusable, and elegant software that can adapt to changing needs.",
    "coverImage": "9780596007126.jpg"
  },
  {
    "title": "Code Complete",
    "author": "Steve McConnell",
    "isbn": "9780735619678",
    "price": 49.99,
    "cost": 25.50,
    "stock": 9,
    "category": "Software Development",
    "location": "A2",
    "publisher": "Microsoft Press",
    "description": "Widely considered one of the best practical guides to programming, 'Code Complete' synthesizes the most effective techniques and must-know principles into a clear, pragmatic handbook. Author Steve McConnell draws from academic research, commercial practice, and his extensive experience to provide comprehensive guidance on every aspect of software construction. Topics range from detailed techniques for naming variables and formatting code to strategies for managing complexity, debugging, and refactoring. This encyclopedic volume helps developers build high-quality software, bridge the gap between knowledge and practice, and stimulate their thinking about creating better code from the ground up.",
    "coverImage": "9780735619678.jpg"
  },
  {
    "title": "The Mythical Man-Month",
    "author": "Frederick P. Brooks Jr.",
    "isbn": "9780201835953",
    "price": 34.50,
    "cost": 17.00,
    "stock": 18,
    "category": "Software Development",
    "location": "A2",
    "publisher": "Addison-Wesley Professional",
    "description": "A timeless classic in software project management, 'The Mythical Man-Month' offers insightful essays on the challenges of managing complex software projects. Frederick P. Brooks Jr., drawing from his experience as project manager for the IBM System/360, presents a series of compelling arguments and observations. The central thesis, known as Brooks's Law, states that 'adding manpower to a late software project makes it later.' He also explores the importance of conceptual integrity, the benefits of a 'surgical team' approach to programming, and the inherent difficulties in software engineering. Decades after its initial publication, its wisdom remains profoundly relevant for managers and developers alike.",
    "coverImage": "9780201835953.jpg"
  },
  {
    "title": "Dune",
    "author": "Frank Herbert",
    "isbn": "9780441013593",
    "price": 18.00,
    "cost": 9.00,
    "stock": 25,
    "category": "Science Fiction",
    "location": "B3",
    "publisher": "Ace Books",
    "description": "Frank Herbert's 'Dune' is a landmark of science fiction, an epic tale of politics, religion, and ecology set on the desert planet Arrakis. The story follows the young Paul Atreides, whose noble family accepts the stewardship of Arrakis, the universe's only source of the valuable spice 'melange.' This powerful substance extends life and enhances mental abilities, making control of the planet a coveted prize. When his family is betrayed, Paul must navigate the treacherous political landscape and the harsh desert environment, eventually leading the planet's native Fremen in a rebellion that could change the course of the galaxy forever.",
    "coverImage": "9780441013593.jpg"
  },
  {
    "title": "Neuromancer",
    "author": "William Gibson",
    "isbn": "9780441569595",
    "price": 16.99,
    "cost": 8.50,
    "stock": 14,
    "category": "Science Fiction",
    "location": "B3",
    "publisher": "Ace Books",
    "description": "The novel that defined the cyberpunk genre, 'Neuromancer' is a visionary, gritty exploration of a high-tech, dystopian future. The story introduces Case, a washed-up cyberspace hacker whose nervous system was damaged as punishment for theft. Living in the futuristic underworld of Chiba City, Japan, he is given a chance at a cure by a mysterious employer who hires him for one last, impossible job. This mission plunges him into a world of artificial intelligences, powerful mega-corporations, and a vast, global computer network known as the 'matrix.' Gibson's groundbreaking work introduced concepts that have deeply influenced modern science fiction and our understanding of the digital age.",
    "coverImage": "9780441569595.jpg"
  },
  {
    "title": "Foundation",
    "author": "Isaac Asimov",
    "isbn": "9780553803716",
    "price": 17.50,
    "cost": 8.75,
    "stock": 30,
    "category": "Science Fiction",
    "location": "B3",
    "publisher": "Bantam Spectra",
    "description": "Isaac Asimov's 'Foundation' is a cornerstone of the science fiction genre, introducing the brilliant concept of 'psychohistory.' The story begins with Hari Seldon, a visionary mathematician who develops a method to predict the future on a grand scale. Foreseeing the imminent collapse of the Galactic Empire, followed by a 30,000-year dark age, he establishes two Foundations at opposite ends of the galaxy. These Foundations are tasked with preserving the collective knowledge of humanity and guiding civilization back to greatness in a much shorter time. The novel chronicles the early years of the first Foundation as it navigates political and military crises using Seldon's calculated predictions.",
    "coverImage": "9780553803716.jpg"
  },
  {
    "title": "The Hitchhiker's Guide to the Galaxy",
    "author": "Douglas Adams",
    "isbn": "9780345391803",
    "price": 12.99,
    "cost": 6.50,
    "stock": 42,
    "category": "Science Fiction",
    "location": "B4",
    "publisher": "Del Rey Books",
    "description": "A wildly inventive and hilarious journey through space, 'The Hitchhiker's Guide to the Galaxy' begins moments before Earth is demolished to make way for a galactic freeway. Arthur Dent, an ordinary Englishman, is saved by his friend Ford Prefect, who turns out to be an alien researcher for the titular guide. What follows is a series of absurd adventures across the universe, featuring a two-headed, ex-hippie President of the Galaxy, a chronically depressed robot, and the quest to find the ultimate answer to life, the universe, and everything. Douglas Adams's book is a masterclass in satirical wit and imaginative storytelling.",
    "coverImage": "9780345391803.jpg"
  },
  {
    "title": "Ender's Game",
    "author": "Orson Scott Card",
    "isbn": "9780812550702",
    "price": 15.99,
    "cost": 8.00,
    "stock": 22,
    "category": "Science Fiction",
    "location": "B4",
    "publisher": "Tor Books",
    "description": "In a future where humanity is at war with an insectoid alien race, the survival of the species depends on finding the perfect military commander. 'Ender's Game' tells the story of Andrew 'Ender' Wiggin, a brilliant and compassionate child who is recruited into the elite Battle School. There, he and other gifted children are subjected to increasingly difficult and morally ambiguous war games, designed to train them for the real conflict. The novel is a gripping exploration of leadership, strategy, and the psychological toll of war, raising profound questions about morality, empathy, and the nature of the enemy.",
    "coverImage": "9780812550702.jpg"
  },
  {
    "title": "Project Hail Mary",
    "author": "Andy Weir",
    "isbn": "9780593135204",
    "price": 28.00,
    "cost": 14.00,
    "stock": 19,
    "category": "Science Fiction",
    "location": "B4",
    "publisher": "Ballantine Books",
    "description": "From the author of 'The Martian,' this thrilling sci-fi adventure follows Ryland Grace, a middle school science teacher who wakes up on a spaceship millions of miles from home with no memory of who he is or his mission. As his memories slowly return, he realizes he is on a last-ditch effort to save humanity from an extinction-level threat. 'Project Hail Mary' is a captivating story of scientific problem-solving, interstellar discovery, and an unlikely friendship that holds the key to survival. It's a tale filled with suspense, humor, and a deep appreciation for the power of science and human ingenuity.",
    "coverImage": "9780593135204.jpg"
  },
  {
    "title": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "isbn": "9780547928227",
    "price": 15.00,
    "cost": 7.50,
    "stock": 3,
    "category": "Fantasy",
    "location": "B2",
    "publisher": "Houghton Mifflin Harcourt",
    "description": "A timeless classic and the prelude to 'The Lord of the Rings,' 'The Hobbit' is the enchanting story of Bilbo Baggins, a respectable hobbit who prefers the comforts of home. His peaceful life is turned upside down when the wizard Gandalf and a company of thirteen dwarves arrive at his door, recruiting him for an adventure to reclaim their stolen treasure from the fearsome dragon, Smaug. The journey takes Bilbo through the perilous landscapes of Middle-earth, where he encounters trolls, elves, goblins, and a mysterious creature named Gollum, from whom he acquires a magical ring that will change his life forever.",
    "coverImage": "9780547928227.jpg"
  },
  {
    "title": "A Game of Thrones",
    "author": "George R.R. Martin",
    "isbn": "9780553593716",
    "price": 22.00,
    "cost": 11.00,
    "stock": 1,
    "category": "Fantasy",
    "location": "B2",
    "publisher": "Bantam Spectra",
    "description": "The first book in the monumental 'A Song of Ice and Fire' series, 'A Game of Thrones' plunges readers into the politically charged and morally complex world of Westeros. The story unfolds through the perspectives of several characters from the noble houses vying for control of the Iron Throne. When Lord Eddard Stark of Winterfell is asked to become the Hand of the King, he is drawn into a web of intrigue, betrayal, and conspiracy in the capital city of King's Landing. Meanwhile, an ancient, supernatural threat stirs in the frozen North, and the exiled last scion of a deposed dynasty gathers power across the sea.",
    "coverImage": "9780553593716.jpg"
  },
  {
    "title": "The Name of the Wind",
    "author": "Patrick Rothfuss",
    "isbn": "9780756404741",
    "price": 18.99,
    "cost": 9.50,
    "stock": 7,
    "category": "Fantasy",
    "location": "B1",
    "publisher": "DAW Books",
    "description": "This is the captivating first-person narrative of Kvothe, a man who is an infamous wizard, accomplished thief, and legendary musician. Now living in obscurity as a simple innkeeper, he agrees to tell his life story to a Chronicler over the course of three days. 'The Name of the Wind' is the first day of this telling, recounting his childhood as a traveling performer, the tragedy that left him orphaned and alone in a crime-ridden city, and his daring and determined efforts to enter the legendary University, a center of magic and knowledge. Rothfuss's lyrical prose and intricate world-building create an unforgettable reading experience.",
    "coverImage": "9780756404741.jpg"
  },
  {
    "title": "Mistborn: The Final Empire",
    "author": "Brandon Sanderson",
    "isbn": "9780765350381",
    "price": 19.50,
    "cost": 9.75,
    "stock": 13,
    "category": "Fantasy",
    "location": "B1",
    "publisher": "Tor Books",
    "description": "Set in a dystopian world where ash constantly falls from the sky and a tyrannical, immortal Lord Ruler has oppressed the people for a thousand years, 'Mistborn' is a thrilling tale of rebellion. The story centers on Vin, a young street urchin who discovers she possesses the rare and powerful magical abilities of a Mistborn, allowing her to 'burn' metals for superhuman powers. She is recruited by a charismatic thief named Kelsier, who plans an audacious heist to overthrow the Lord Ruler's empire. With its unique and detailed magic system of Allomancy and a fast-paced plot, this book is a modern fantasy classic.",
    "coverImage": "9780765350381.jpg"
  },
  {
    "title": "The Eye of the World",
    "author": "Robert Jordan",
    "isbn": "9780812511819",
    "price": 21.00,
    "cost": 10.50,
    "stock": 6,
    "category": "Fantasy",
    "location": "B1",
    "publisher": "Tor Books",
    "description": "The first volume in the epic 'Wheel of Time' series, 'The Eye of the World' introduces a vast and richly detailed world steeped in magic and prophecy. The story begins in the peaceful, isolated village of Emond's Field, which is unexpectedly attacked by monstrous Trollocs. To save their home, three young men—Rand al'Thor, Mat Cauthon, and Perrin Aybara—must flee with the guidance of an enigmatic sorceress, Moiraine. They soon learn that the Dark One, an ancient evil, is stirring from his prison and that one of them is the Dragon Reborn, a prophesied figure destined to either save the world or break it.",
    "coverImage": "9780812511819.jpg"
  },
  {
    "title": "Designing Data-Intensive Applications",
    "author": "Martin Kleppmann",
    "isbn": "9781449373320",
    "price": 55.00,
    "cost": 30.00,
    "stock": 12,
    "category": "Databases",
    "location": "A2",
    "publisher": "O'Reilly Media",
    "description": "An essential read for software architects and engineers, this book provides a comprehensive overview of the principles and practicalities of data systems. Author Martin Kleppmann takes a deep dive into the architecture of modern applications, examining the pros and cons of various technologies for storing and processing data. The book explores the fundamental challenges of data systems, including scalability, consistency, reliability, maintainability, and evolvability. Rather than promoting a single tool, it equips readers with the conceptual understanding needed to navigate the complex landscape of databases, stream processors, and batch systems, and to build robust and scalable applications.",
    "coverImage": "9781449373320.jpg"
  },
  {
    "title": "Database System Concepts",
    "author": "Abraham Silberschatz",
    "isbn": "9780073523323",
    "price": 85.00,
    "cost": 45.00,
    "stock": 8,
    "category": "Databases",
    "location": "A3",
    "publisher": "McGraw-Hill Education",
    "description": "Often referred to as the 'Sailboat Book,' this is a cornerstone text for computer science students and professionals seeking a deep understanding of database management systems. It covers the fundamental concepts of database design and implementation, including the relational model, SQL, entity-relationship modeling, and normalization. The book also delves into advanced topics such as transaction management, concurrency control, query processing, and database system architecture. Its clear explanations, extensive examples, and coverage of both theoretical foundations and practical applications make it an authoritative and indispensable resource for anyone working with databases.",
    "coverImage": "9780073523323.jpg"
  },
  {
    "title": "SQL Antipatterns",
    "author": "Bill Karwin",
    "isbn": "9781934356555",
    "price": 42.00,
    "cost": 21.00,
    "stock": 16,
    "category": "Databases",
    "location": "A3",
    "publisher": "The Pragmatic Programmers",
    "description": "This practical guide helps developers avoid common pitfalls and write better SQL. Author Bill Karwin identifies 25 common 'antipatterns'—mistakes frequently made in database design, querying, and application development—and provides clear, actionable solutions for each. The book is structured around recognizing a problem, understanding why it's a problem, and implementing a correct solution. Topics covered include logical database design flaws, physical design errors, common query mistakes, and application development issues. By learning to identify and avoid these antipatterns, readers can build more robust, scalable, and maintainable database-driven applications.",
    "coverImage": "9781934356555.jpg"
  },
  {
    "title": "Seven Databases in Seven Weeks",
    "author": "Eric Redmond, Jim R. Wilson",
    "isbn": "9781934356920",
    "price": 38.00,
    "cost": 19.50,
    "stock": 14,
    "category": "Databases",
    "location": "A3",
    "publisher": "The Pragmatic Programmers",
    "description": "In an era where the one-size-fits-all relational database is no longer sufficient, this book provides a fast-paced tour of the diverse landscape of modern databases. It introduces readers to seven different database technologies in seven chapters, each focusing on a different data model: relational (PostgreSQL), key-value (Redis), columnar (HBase), document (MongoDB), graph (Neo4j), and more. For each database, the authors explain the core concepts, demonstrate its strengths, and provide hands-on examples. This book is perfect for developers who want to broaden their understanding of data storage and choose the right tool for the right job.",
    "coverImage": "9781934356920.jpg"
  },
  {
    "title": "MongoDB: The Definitive Guide",
    "author": "Shannon Bradshaw",
    "isbn": "9781491954461",
    "price": 49.95,
    "cost": 26.00,
    "stock": 10,
    "category": "Databases",
    "location": "A3",
    "publisher": "O'Reilly Media",
    "description": "This comprehensive guide is the authoritative resource for developers working with the popular NoSQL database, MongoDB. It covers everything from the basics of installation and data modeling to advanced topics like indexing, aggregation, replication, and sharding. The book provides in-depth explanations and practical examples to help you build and manage high-performance, scalable applications. Whether you're a novice looking to get started or an experienced developer seeking to master MongoDB's powerful features, this guide offers the detailed knowledge you need to effectively leverage this flexible and powerful document-oriented database in your projects.",
    "coverImage": "9781491954461.jpg"
  },
  {
    "title": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "isbn": "9780062316097",
    "price": 24.99,
    "cost": 12.50,
    "stock": 28,
    "category": "History",
    "location": "C1",
    "publisher": "HarperCollins",
    "description": "In this sweeping narrative, Yuval Noah Harari explores the entire history of the human species, from the emergence of Homo sapiens in Africa to the political and technological revolutions of the 21st century. 'Sapiens' examines how our species came to dominate the planet, attributing our success to our unique ability to cooperate in large numbers through shared myths and fictions, such as money, religion, and nations. Harari structures the book around three major revolutions: the Cognitive Revolution, the Agricultural Revolution, and the Scientific Revolution. It's a thought-provoking and accessible exploration of who we are, how we got here, and where we might be going.",
    "coverImage": "9780062316097.jpg"
  },
  {
    "title": "Guns, Germs, and Steel",
    "author": "Jared Diamond",
    "isbn": "9780393317558",
    "price": 18.99,
    "cost": 9.50,
    "stock": 15,
    "category": "History",
    "location": "C1",
    "publisher": "W. W. Norton & Company",
    "description": "Jared Diamond's Pulitzer Prize-winning book seeks to answer a profound question: why did history unfold so differently on different continents? 'Guns, Germs, and Steel' argues that the disparities in power and technology between human societies are not due to innate racial differences but rather to environmental factors. Diamond compellingly demonstrates how geography, climate, and the availability of domesticable plants and animals gave Eurasian civilizations a head start, leading to greater population density, technological innovation, and immunity to epidemic diseases. This interdisciplinary work combines history, biology, and linguistics to offer a powerful explanation for the broad patterns of human history.",
    "coverImage": "9780393317558.jpg"
  },
  {
    "title": "The Devil in the White City",
    "author": "Erik Larson",
    "isbn": "9780375725609",
    "price": 17.00,
    "cost": 8.50,
    "stock": 11,
    "category": "History",
    "location": "C2",
    "publisher": "Crown Publishers",
    "description": "Erik Larson masterfully intertwines two true and compelling stories set against the backdrop of the 1893 Chicago World's Fair. The first follows Daniel H. Burnham, the brilliant architect responsible for constructing the fair's magnificent 'White City,' a massive project fraught with immense challenges. The second story follows Dr. H. H. Holmes, a cunning and charismatic serial killer who used the fair to lure his victims to their deaths in his specially constructed, labyrinthine 'Murder Castle.' Larson's meticulous research and narrative skill bring this Gilded Age spectacle to life, creating a non-fiction thriller that is both historically rich and deeply unsettling.",
    "coverImage": "9780375725609.jpg"
  },
  {
    "title": "1776",
    "author": "David McCullough",
    "isbn": "9780743226714",
    "price": 20.00,
    "cost": 10.00,
    "stock": 9,
    "category": "History",
    "location": "C2",
    "publisher": "Simon & Schuster",
    "description": "Pulitzer Prize-winning historian David McCullough provides a gripping account of one of the most pivotal years in American history. '1776' chronicles the story of the American Revolution during this crucial period, focusing on the leadership of George Washington and the trials faced by the Continental Army. The book vividly portrays the major campaigns and battles of the year, including the disastrous loss of New York and the daring, tide-turning victory at Trenton. Based on extensive research of archival materials from both American and British sources, McCullough brings the people, places, and events of the revolution to life with brilliant clarity and narrative force.",
    "coverImage": "9780743226714.jpg"
  },
  {
    "title": "The Wright Brothers",
    "author": "David McCullough",
    "isbn": "9781476728742",
    "price": 18.00,
    "cost": 9.00,
    "stock": 13,
    "category": "History",
    "location": "C2",
    "publisher": "Simon & Schuster",
    "description": "In this compelling biography, David McCullough tells the dramatic story-behind-the-story of Wilbur and Orville Wright. Far from being simple mechanics, the Wright brothers were men of exceptional courage, determination, and wide-ranging intellectual interests. McCullough draws on a wealth of family correspondence, diaries, and notebooks to paint an intimate portrait of their lives, from their upbringing in Ohio to their meticulous scientific experiments that finally led to the first successful powered, heavier-than-air flight in 1903. The book celebrates their quintessentially American story of perseverance, ingenuity, and the triumph of a revolutionary invention that changed the world.",
    "coverImage": "9781476728742.jpg"
  },
  {
    "title": "The Silk Roads: A New History of the World",
    "author": "Peter Frankopan",
    "isbn": "9780307948889",
    "price": 22.00,
    "cost": 11.00,
    "stock": 17,
    "category": "History",
    "location": "C1",
    "publisher": "Vintage Books",
    "description": "Peter Frankopan's ambitious work reorients our perspective on world history, shifting the focus away from the traditional Western narrative and placing it firmly on the East. He argues that the 'Silk Roads'—the network of trade routes that connected Asia, Europe, and Africa—were the crucible of civilization, a region where empires rose and fell, and where ideas, cultures, religions, and goods flowed and clashed. From the dawn of civilization to the present day, Frankopan traces the extraordinary history of this region, demonstrating its central role in global politics, commerce, and culture. It's a vital and illuminating look at the past and future of the world.",
    "coverImage": "9780307948889.jpg"
  },
  {
    "title": "The Silent Patient",
    "author": "Alex Michaelides",
    "isbn": "9781250301697",
    "price": 26.99,
    "cost": 13.50,
    "stock": 35,
    "category": "Mystery",
    "location": "D1",
    "publisher": "Celadon Books",
    "description": "A shocking psychological thriller, 'The Silent Patient' follows criminal psychotherapist Theo Faber, who is determined to unravel the mystery of Alicia Berenson. Alicia, a famous painter, has gone completely silent after brutally murdering her fashion photographer husband. Her refusal to speak turns a domestic tragedy into a grand mystery that captures the public's imagination. Theo, obsessed with the case, secures a position at the secure forensic unit where Alicia is being held. His attempts to get her to talk and uncover the truth about the murder lead him down a twisting path that threatens to consume him, culminating in a stunning, unforgettable climax.",
    "coverImage": "9781250301697.jpg"
  },
  {
    "title": "Gone Girl",
    "author": "Gillian Flynn",
    "isbn": "9780307588371",
    "price": 17.00,
    "cost": 8.50,
    "stock": 21,
    "category": "Mystery",
    "location": "D1",
    "publisher": "Crown Publishing Group",
    "description": "Gillian Flynn's 'Gone Girl' is a masterfully plotted thriller that explores the dark side of a seemingly perfect marriage. On their fifth wedding anniversary, Nick Dunne's beautiful wife, Amy, disappears from their rented home in Missouri. Under pressure from the police and a growing media frenzy, Nick's portrayal of a blissful union begins to crumble. His strange behavior and lies make him the prime suspect. But is he really a killer? Told from alternating perspectives—Nick's present-day account and entries from Amy's diary—the novel creates a suspenseful and unreliable narrative that keeps readers guessing until its famous, shocking twist.",
    "coverImage": "9780307588371.jpg"
  },
  {
    "title": "The Girl with the Dragon Tattoo",
    "author": "Stieg Larsson",
    "isbn": "9780307949480",
    "price": 16.95,
    "cost": 8.00,
    "stock": 10,
    "category": "Mystery",
    "location": "D2",
    "publisher": "Vintage Crime/Black Lizard",
    "description": "This gripping novel introduces the unforgettable duo of Mikael Blomkvist, a disgraced financial journalist, and Lisbeth Salander, a brilliant but deeply troubled computer hacker. Blomkvist is hired by a wealthy industrialist to investigate the 40-year-old disappearance of his niece from their secluded family island. As he delves into the Vanger family's dark history, he crosses paths with Salander. Together, they uncover a web of corruption, misogyny, and murder more complex and horrifying than they could have ever imagined. Larsson's intricate plotting and compelling characters created an international phenomenon that redefined the modern thriller.",
    "coverImage": "9780307949480.jpg"
  },
  {
    "title": "And Then There Were None",
    "author": "Agatha Christie",
    "isbn": "9780062073488",
    "price": 15.99,
    "cost": 7.99,
    "stock": 50,
    "category": "Mystery",
    "location": "D2",
    "publisher": "William Morrow",
    "description": "A masterpiece of suspense from the Queen of Mystery, Agatha Christie. The story follows ten strangers, each with a dark secret, who are lured to a remote island off the English coast. Once there, they are cut off from the mainland and accused of past crimes by a mysterious, unknown host. One by one, they begin to die in ways that eerily mirror the lines of a sinister nursery rhyme. As the survivors' paranoia and suspicion grow, they realize the killer is not hiding on the island—the killer is one of them. It's a brilliantly crafted, chilling tale of guilt and retribution.",
    "coverImage": "9780062073488.jpg"
  },
  {
    "title": "The Da Vinci Code",
    "author": "Dan Brown",
    "isbn": "9780307474278",
    "price": 19.99,
    "cost": 10.00,
    "stock": 24,
    "category": "Mystery",
    "location": "D1",
    "publisher": "Anchor Books",
    "description": "This fast-paced thriller sends Harvard symbologist Robert Langdon on a breathless chase through Paris and London. After a curator at the Louvre is found murdered, with a series of baffling codes and symbols left near his body, Langdon becomes the prime suspect. He teams up with a gifted French cryptologist, Sophie Neveu, and together they must decipher the clues to uncover a secret that has been protected by a secret society for centuries. 'The Da Vinci Code' is a gripping blend of history, art, and conspiracy, filled with puzzles, unexpected twists, and a race against time to reveal a truth that could shake the foundations of Western history.",
    "coverImage": "9780307474278.jpg"
  },
  {
    "title": "The Thursday Murder Club",
    "author": "Richard Osman",
    "isbn": "9781984880963",
    "price": 26.00,
    "cost": 13.00,
    "stock": 18,
    "category": "Mystery",
    "location": "D2",
    "publisher": "Pamela Dorman Books",
    "description": "In a peaceful retirement village, four unlikely friends—Elizabeth, Joyce, Ibrahim, and Ron—meet once a week in the Jigsaw Room to discuss unsolved crimes. They call themselves the Thursday Murder Club. When a local property developer is found dead with a mysterious photograph left next to his body, the club finds itself in the middle of its first live case. The four members use their combined wits, unique skills, and lifetime of experience to unravel the complex mystery, often running circles around the official police investigation. This novel is a charming, witty, and clever whodunit filled with unforgettable characters.",
    "coverImage": "9781984880963.jpg"
  },
  {
    "title": "The 7 Habits of Highly Effective People",
    "author": "Stephen R. Covey",
    "isbn": "9781982137274",
    "price": 19.99,
    "cost": 10.00,
    "stock": 33,
    "category": "Self-Help",
    "location": "E1",
    "publisher": "Simon & Schuster",
    "description": "A perennial bestseller, this book presents a principle-centered approach for solving personal and professional problems. Stephen R. Covey reveals a step-by-step pathway for living with fairness, integrity, service, and human dignity—principles that give us the security to adapt to change and the wisdom and power to take advantage of the opportunities that change creates. The seven habits, including 'Be Proactive,' 'Begin with the End in Mind,' and 'Seek First to Understand, Then to Be Understood,' provide a holistic framework for personal effectiveness, moving from dependence to independence and finally to interdependence, the highest level of human maturity.",
    "coverImage": "9781982137274.jpg"
  },
  {
    "title": "How to Win Friends and Influence People",
    "author": "Dale Carnegie",
    "isbn": "9780671027032",
    "price": 16.00,
    "cost": 8.00,
    "stock": 45,
    "category": "Self-Help",
    "location": "E1",
    "publisher": "Pocket Books",
    "description": "One of the most influential self-help books ever written, Dale Carnegie's classic provides timeless advice on the art of human relations. The book is built on the fundamental idea that you can change other people's behavior simply by changing your own. It offers practical techniques and principles for making people like you, winning them to your way of thinking, and changing them without arousing resentment. Carnegie's advice is rooted in showing genuine interest in others, being a good listener, and making others feel important. For decades, it has helped millions of people climb the ladder of success in their business and personal lives.",
    "coverImage": "9780671027032.jpg"
  },
  {
    "title": "Atomic Habits",
    "author": "James Clear",
    "isbn": "9780735211292",
    "price": 27.00,
    "cost": 13.50,
    "stock": 55,
    "category": "Self-Help",
    "location": "E2",
    "publisher": "Avery",
    "description": "James Clear presents a powerful and practical framework for improving every day. 'Atomic Habits' argues that real change comes from the compound effect of hundreds of small decisions. Clear introduces the concept of 'atomic habits'—tiny, incremental changes that, when repeated, grow into remarkable results. He outlines the Four Laws of Behavior Change: make it obvious, make it attractive, make it easy, and make it satisfying. Drawing on biology, psychology, and neuroscience, this book provides a simple, proven system for building good habits, breaking bad ones, and mastering the tiny behaviors that lead to incredible outcomes.",
    "coverImage": "9780735211292.jpg"
  },
  {
    "title": "The Power of Now",
    "author": "Eckhart Tolle",
    "isbn": "9781577314806",
    "price": 16.00,
    "cost": 8.00,
    "stock": 23,
    "category": "Self-Help",
    "location": "E2",
    "publisher": "New World Library",
    "description": "This profound spiritual guide is a journey into the power of living in the present moment. Eckhart Tolle explains that most of our psychological pain is created by our attachment to the past and anxiety about the future. He teaches that the only true point of existence is the present moment, or the 'Now.' By learning to be intensely present, we can free ourselves from the ego-driven mind, find inner peace, and experience a deeper sense of purpose and joy. The book is structured as a question-and-answer session, making its profound concepts accessible and providing practical ways to achieve a state of mindful presence.",
    "coverImage": "9781577314806.jpg"
  },
  {
    "title": "Thinking, Fast and Slow",
    "author": "Daniel Kahneman",
    "isbn": "9780374533557",
    "price": 18.00,
    "cost": 9.00,
    "stock": 20,
    "category": "Self-Help",
    "location": "E1",
    "publisher": "Farrar, Straus and Giroux",
    "description": "In this groundbreaking work, Nobel laureate Daniel Kahneman takes us on a tour of the mind and explains the two systems that drive the way we think. System 1 is fast, intuitive, and emotional; System 2 is slower, more deliberative, and more logical. Kahneman reveals the extraordinary capabilities, as well as the faults and biases, of fast thinking, and exposes the pervasive influence of intuitive impressions on our thoughts and choices. The book offers practical and enlightening insights into how choices are made in both our business and our personal lives, and how we can use different techniques to guard against the mental glitches that often get us into trouble.",
    "coverImage": "9780374533557.jpg"
  },
  {
    "title": "Salt, Fat, Acid, Heat",
    "author": "Samin Nosrat",
    "isbn": "9781476753836",
    "price": 37.50,
    "cost": 18.75,
    "stock": 19,
    "category": "Cooking",
    "location": "F1",
    "publisher": "Simon & Schuster",
    "description": "Samin Nosrat's revolutionary cookbook teaches the fundamental principles of good cooking by focusing on four key elements: Salt, which enhances flavor; Fat, which delivers flavor and generates texture; Acid, which balances flavor; and Heat, which ultimately determines the texture of food. Instead of just providing recipes, Nosrat explains the 'why' behind the 'how,' empowering home cooks to be more intuitive, creative, and confident in the kitchen. With over 100 essential recipes and dozens of variations, along with charming illustrations, this book provides a master class in the art of cooking that will change the way you think about food.",
    "coverImage": "9781476753836.jpg"
  },
  {
    "title": "The Food Lab: Better Home Cooking Through Science",
    "author": "J. Kenji López-Alt",
    "isbn": "9780393081084",
    "price": 49.95,
    "cost": 25.00,
    "stock": 12,
    "category": "Cooking",
    "location": "F1",
    "publisher": "W. W. Norton & Company",
    "description": "A definitive guide for the curious home cook, 'The Food Lab' explores the science behind beloved American dishes. J. Kenji López-Alt applies a rigorous, scientific approach to cooking, questioning conventional wisdom and using controlled experiments to understand how to achieve the best results. The book explains the fundamental principles of heat, energy, and molecular interactions that affect our food. Packed with hundreds of easy-to-make recipes and thousands of full-color images, this comprehensive volume teaches readers not just how to cook a great meal, but how to become better, more confident cooks by understanding the science of the kitchen.",
    "coverImage": "9780393081084.jpg"
  },
  {
    "title": "Joy of Cooking",
    "author": "Irma S. Rombauer",
    "isbn": "9781501169717",
    "price": 35.00,
    "cost": 17.50,
    "stock": 25,
    "category": "Cooking",
    "location": "F2",
    "publisher": "Scribner",
    "description": "An iconic and indispensable kitchen resource for generations, 'Joy of Cooking' is a comprehensive culinary bible. First self-published in 1931, it has been continuously updated to reflect modern tastes and techniques while retaining its classic, reliable charm. The book contains thousands of recipes covering everything from simple weeknight meals to elaborate holiday feasts. More than just a collection of recipes, it's a teaching cookbook that explains techniques, defines terms, and offers variations, making it an essential tool for both novice and experienced home cooks. Its thoroughness and friendly, encouraging tone have made it a trusted companion in American kitchens.",
    "coverImage": "9781501169717.jpg"
  },
  {
    "title": "Cravings: Recipes for All the Food You Want to Eat",
    "author": "Chrissy Teigen",
    "isbn": "9781101903919",
    "price": 29.99,
    "cost": 15.00,
    "stock": 31,
    "category": "Cooking",
    "location": "F2",
    "publisher": "Clarkson Potter",
    "description": "Chrissy Teigen's debut cookbook is a vibrant and humorous collection of recipes that are all about comfort, flavor, and satisfying cravings. The book is filled with the kind of food people truly want to eat, from hearty breakfast dishes and savory snacks to decadent dinners and desserts. With recipes like John's Fried Chicken with Spicy Honey Butter and her mom's Thai classics, Teigen shares food that is both indulgent and approachable. Her witty commentary and relatable stories make the cookbook as entertaining to read as it is to cook from, offering a fun and delicious glimpse into her kitchen.",
    "coverImage": "9781101903919.jpg"
  },
  {
    "title": "Mastering the Art of French Cooking",
    "author": "Julia Child",
    "isbn": "9780307958174",
    "price": 40.00,
    "cost": 20.00,
    "stock": 14,
    "category": "Cooking",
    "location": "F1",
    "publisher": "Alfred A. Knopf",
    "description": "A landmark work of culinary literature, this cookbook is responsible for bringing sophisticated French cuisine to the American home cook. Julia Child, along with her co-authors, provides meticulously detailed recipes that demystify classic French techniques. The book is renowned for its clarity, thoroughness, and precision, covering everything from classic sauces and soups to elaborate main courses and pastries. It teaches the fundamental techniques of French cooking in a way that is accessible and encouraging, empowering readers to create authentic and delicious French dishes. It remains an essential reference for anyone serious about the art of cooking.",
    "coverImage": "9780307958174.jpg"
  },
  {
    "title": "Steve Jobs",
    "author": "Walter Isaacson",
    "isbn": "9781451648539",
    "price": 35.00,
    "cost": 17.50,
    "stock": 20,
    "category": "Biography",
    "location": "C3",
    "publisher": "Simon & Schuster",
    "description": "Based on more than forty interviews with Steve Jobs conducted over two years—as well as interviews with more than a hundred family members, friends, adversaries, competitors, and colleagues—Walter Isaacson has written the definitive biography of the visionary Apple co-founder. Isaacson provides an unvarnished and intimate portrait of a complex man whose passions, perfectionism, and ferocious drive revolutionized six industries: personal computers, animated movies, music, phones, tablet computing, and digital publishing. The book explores the life of a creative entrepreneur whose story is both instructive and cautionary, filled with lessons about innovation, character, leadership, and values.",
    "coverImage": "9781451648539.jpg"
  },
  {
    "title": "Educated: A Memoir",
    "author": "Tara Westover",
    "isbn": "9780399590504",
    "price": 28.00,
    "cost": 14.00,
    "stock": 27,
    "category": "Biography",
    "location": "C3",
    "publisher": "Random House",
    "description": "A remarkable and inspiring memoir, 'Educated' is the story of Tara Westover, who was raised in a radical, survivalist family in the mountains of Idaho and did not set foot in a classroom until she was seventeen. Her quest for knowledge transformed her, taking her across oceans and continents to Harvard and to Cambridge University. The book is a powerful exploration of the struggle for self-invention, the fierce love of family, and the profound grief that comes with severing one's closest ties. Westover's journey is a testament to the transformative power of education and the courage it takes to redefine one's own life.",
    "coverImage": "9780399590504.jpg"
  },
  {
    "title": "The Diary of a Young Girl",
    "author": "Anne Frank",
    "isbn": "9780553296983",
    "price": 14.99,
    "cost": 7.50,
    "stock": 34,
    "category": "Biography",
    "location": "C4",
    "publisher": "Bantam Books",
    "description": "This is the poignant, personal diary of Anne Frank, a Jewish teenager who went into hiding with her family during the Nazi occupation of Amsterdam in World War II. For two years, she chronicled her thoughts, feelings, and experiences while living in a secret annex. Her diary offers a vivid and intimate look at adolescence, capturing her hopes, fears, and observations with remarkable wisdom and honesty. It stands as a powerful testament to the human spirit's resilience in the face of unimaginable adversity and serves as a lasting reminder of the horrors of the Holocaust. It is one of the most widely read and beloved books in the world.",
    "coverImage": "9780553296983.jpg"
  },
  {
    "title": "Becoming",
    "author": "Michelle Obama",
    "isbn": "9781524763138",
    "price": 32.50,
    "cost": 16.25,
    "stock": 40,
    "category": "Biography",
    "location": "C4",
    "publisher": "Crown Publishing Group",
    "description": "In her deeply personal and inspiring memoir, former First Lady of the United States Michelle Obama invites readers into her world. She chronicles her journey from her childhood on the South Side of Chicago to her years as a successful executive balancing the demands of motherhood and work, and finally to her time spent at the world's most famous address. With honesty and wit, she describes her triumphs and disappointments, both public and private. 'Becoming' is an intimate account of a woman who has steadily defied expectations, offering a powerful message of resilience, purpose, and the importance of finding one's own voice.",
    "coverImage": "9781524763138.jpg"
  },
  {
    "title": "Shoe Dog: A Memoir by the Creator of Nike",
    "author": "Phil Knight",
    "isbn": "9781501135910",
    "price": 20.00,
    "cost": 10.00,
    "stock": 22,
    "category": "Biography",
    "location": "C3",
    "publisher": "Scribner",
    "description": "In this candid and riveting memoir, Nike founder and board chairman Phil Knight shares the inside story of the company's early days as a fearless start-up and its evolution into one of the world's most iconic brands. Fresh out of business school, Knight borrowed fifty dollars from his father and launched a company with a simple mission: import high-quality, low-cost running shoes from Japan. He details the many risks, crushing setbacks, and ruthless competitors he encountered along the way. 'Shoe Dog' is a refreshingly honest story about building a business from scratch, a tale of grit, determination, and the power of a shared mission.",
    "coverImage": "9781501135910.jpg"
  },
  {
    "title": "Freakonomics",
    "author": "Steven D. Levitt, Stephen J. Dubner",
    "isbn": "9780060731335",
    "price": 17.99,
    "cost": 9.00,
    "stock": 26,
    "category": "Economics",
    "location": "E3",
    "publisher": "William Morrow",
    "description": "This highly entertaining and thought-provoking book applies the tools of economics to explore the hidden side of everything. Economist Steven D. Levitt and journalist Stephen J. Dubner tackle a diverse range of unconventional questions: Which is more dangerous, a gun or a swimming pool? What do schoolteachers and sumo wrestlers have in common? How is the Ku Klux Klan like a group of real-estate agents? By analyzing data and incentives, they reveal that the modern world is even more intriguing than we think. 'Freakonomics' is a groundbreaking collaboration that challenges conventional wisdom and shows that economics is, at its root, the study of how people get what they want.",
    "coverImage": "9780060731335.jpg"
  },
  {
    "title": "The Wealth of Nations",
    "author": "Adam Smith",
    "isbn": "9780553585971",
    "price": 15.00,
    "cost": 7.50,
    "stock": 15,
    "category": "Economics",
    "location": "E3",
    "publisher": "Bantam Classics",
    "description": "Published in 1776, Adam Smith's magnum opus is the foundational text of modern economics. In 'The Wealth of Nations,' Smith presents a comprehensive analysis of the principles of a market-based economy. He introduces fundamental concepts such as the division of labor, productivity, and free markets. His most famous concept is the 'invisible hand,' the idea that individuals pursuing their own self-interest can inadvertently promote the good of society. This book is a profound inquiry into the nature and causes of economic prosperity and provides a timeless argument for the benefits of capitalism and economic freedom.",
    "coverImage": "9780553585971.jpg"
  },
  {
    "title": "Capital in the Twenty-First Century",
    "author": "Thomas Piketty",
    "isbn": "9780674430006",
    "price": 39.95,
    "cost": 20.00,
    "stock": 9,
    "category": "Economics",
    "location": "E4",
    "publisher": "Harvard University Press",
    "description": "In this landmark work, French economist Thomas Piketty analyzes a unique collection of data from twenty countries, dating back to the eighteenth century, to uncover key economic and social patterns. His central thesis is that when the rate of return on capital (r) is greater than the rate of economic growth (g) over the long term, the result is a concentration of wealth and increasing inequality. Piketty's detailed analysis provides a comprehensive look at the dynamics of wealth and inequality, sparking a global debate about economic policy and the future of capitalism in the modern world.",
    "coverImage": "9780674430006.jpg"
  },
  {
    "title": "The Undercover Economist",
    "author": "Tim Harford",
    "isbn": "9780199206534",
    "price": 16.95,
    "cost": 8.50,
    "stock": 18,
    "category": "Economics",
    "location": "E4",
    "publisher": "Oxford University Press",
    "description": "Tim Harford demystifies the world of economics by revealing the economic principles behind everyday life. Acting as an 'undercover economist,' he explains complex concepts like supply and demand, market failure, and game theory by looking at familiar situations, from buying a cup of coffee to navigating traffic congestion. The book shows how economic forces shape our world in ways we might not expect, explaining why some countries are rich while others are poor, and how businesses try to extract money from consumers. It's an accessible and entertaining introduction to economics that empowers readers to see the world through a new lens.",
    "coverImage": "9780199206534.jpg"
  },
  {
    "title": "Nudge: Improving Decisions About Health, Wealth, and Happiness",
    "author": "Richard H. Thaler, Cass R. Sunstein",
    "isbn": "9780143115267",
    "price": 18.00,
    "cost": 9.00,
    "stock": 21,
    "category": "Economics",
    "location": "E3",
    "publisher": "Penguin Books",
    "description": "This fascinating book explores the field of behavioral economics and the concept of 'choice architecture.' The authors argue that humans are not perfectly rational decision-makers and are often influenced by biases and cognitive shortcuts. A 'nudge' is a subtle change in how choices are presented that can influence people to make better decisions without restricting their freedom. The book provides numerous examples of how small nudges can lead to significant improvements in areas like saving for retirement, organ donation, and healthy eating. It's a compelling look at how we can design environments that help people make choices that improve their lives.",
    "coverImage": "9780143115267.jpg"
  },
  {
    "title": "Meditations",
    "author": "Marcus Aurelius",
    "isbn": "9780140449334",
    "price": 12.00,
    "cost": 6.00,
    "stock": 38,
    "category": "Philosophy",
    "location": "G1",
    "publisher": "Penguin Classics",
    "description": "A series of personal writings by the Roman Emperor Marcus Aurelius, 'Meditations' is a profound and enduring work of Stoic philosophy. Written as a source for his own guidance and self-improvement, the book consists of reflections on virtue, reason, duty, and the nature of the universe. Marcus Aurelius offers timeless wisdom on how to live a meaningful and tranquil life by practicing self-discipline, accepting what is beyond our control, and maintaining a strong moral purpose. It is a practical guide to finding peace and resilience in the face of life's challenges, and its insights remain deeply relevant to the modern reader.",
    "coverImage": "9780140449334.jpg"
  },
  {
    "title": "Thus Spoke Zarathustra",
    "author": "Friedrich Nietzsche",
    "isbn": "9780140441185",
    "price": 14.00,
    "cost": 7.00,
    "stock": 16,
    "category": "Philosophy",
    "location": "G1",
    "publisher": "Penguin Classics",
    "description": "One of Friedrich Nietzsche's most famous and challenging works, 'Thus Spoke Zarathustra' is a philosophical novel that explores many of his key ideas through the fictional prophet Zarathustra. The book introduces concepts like the 'Übermensch' (Overman or Superman), a being who has overcome traditional morality to create their own values; the 'will to power' as the fundamental drive of all beings; and the 'eternal recurrence,' the idea that all events will repeat themselves infinitely. Written in a lyrical, poetic style, the book is a powerful critique of traditional religion and morality and a call for humanity to strive for a higher state of being.",
    "coverImage": "9780140441185.jpg"
  },
  {
    "title": "The Republic",
    "author": "Plato",
    "isbn": "9780140455113",
    "price": 13.00,
    "cost": 6.50,
    "stock": 24,
    "category": "Philosophy",
    "location": "G2",
    "publisher": "Penguin Classics",
    "description": "A foundational text of Western philosophy, Plato's 'The Republic' is a Socratic dialogue that explores the nature of justice and the ideal state. Through a series of conversations led by his teacher, Socrates, Plato constructs a vision of a utopian society ruled by philosopher-kings. The dialogue delves into profound questions about ethics, politics, metaphysics, and epistemology. It introduces famous allegories, such as the Allegory of the Cave, which illustrates the journey from ignorance to enlightenment. 'The Republic' remains a powerful and influential work, shaping political and philosophical thought for over two millennia.",
    "coverImage": "9780140455113.jpg"
  },
  {
    "title": "Sophie's World",
    "author": "Jostein Gaarder",
    "isbn": "9780374530716",
    "price": 22.00,
    "cost": 11.00,
    "stock": 13,
    "category": "Philosophy",
    "location": "G2",
    "publisher": "Farrar, Straus and Giroux",
    "description": "This unique novel serves as both an engaging mystery and a comprehensive introduction to the history of Western philosophy. The story follows Sophie Amundsen, a Norwegian teenager who begins receiving mysterious letters that pose philosophical questions and provide lessons on thinkers from Socrates to Sartre. As she delves deeper into this correspondence course, she becomes entangled in a complex mystery that challenges her understanding of reality itself. 'Sophie's World' brilliantly weaves a history of philosophy into a compelling narrative, making complex ideas accessible and exciting for readers of all ages.",
    "coverImage": "9780374530716.jpg"
  },
  {
    "title": "Beyond Good and Evil",
    "author": "Friedrich Nietzsche",
    "isbn": "9780140449235",
    "price": 15.00,
    "cost": 7.50,
    "stock": 17,
    "category": "Philosophy",
    "location": "G1",
    "publisher": "Penguin Classics",
    "description": "In this powerful and aphoristic work, Friedrich Nietzsche continues his critique of traditional morality and philosophy. He argues that past philosophers have been constrained by a dogmatic belief in binary oppositions, such as good and evil, truth and falsehood. Nietzsche calls for a new kind of philosopher, a 'free spirit,' who can move beyond these conventional moralities to create new values. He explores concepts like the 'will to power' and the 'master-slave morality,' offering a sharp and often controversial analysis of human nature, society, and the future of philosophy. It is a challenging and essential text for understanding Nietzsche's mature thought.",
    "coverImage": "9780140449235.jpg"
  },
  {
    "title": "The Very Hungry Caterpillar",
    "author": "Eric Carle",
    "isbn": "9780399226908",
    "price": 10.99,
    "cost": 5.50,
    "stock": 60,
    "category": "Children's Books",
    "location": "H1",
    "publisher": "Philomel Books",
    "description": "A beloved classic for generations, Eric Carle's 'The Very Hungry Caterpillar' is a charming and educational story for young children. The book follows the journey of a newly hatched caterpillar as it eats its way through a wide variety of foods, from one apple on Monday to a feast of treats on Saturday. The story's iconic die-cut pages and vibrant collage illustrations make it an interactive and visually engaging experience. It beautifully teaches concepts like counting, the days of the week, and the life cycle of a butterfly, culminating in the caterpillar's transformation into a beautiful butterfly. Its timeless appeal continues to delight children worldwide.",
    "coverImage": "9780399226908.jpg"
  },
  {
    "title": "Where the Wild Things Are",
    "author": "Maurice Sendak",
    "isbn": "9780060254926",
    "price": 18.95,
    "cost": 9.50,
    "stock": 45,
    "category": "Children's Books",
    "location": "H1",
    "publisher": "Harper & Row",
    "description": "This Caldecott Medal-winning picture book is a profound and imaginative exploration of a child's emotions. The story follows Max, a mischievous young boy in a wolf suit who is sent to his room without his supper. His room then undergoes a magical transformation into a jungle environment, and he sails off to an island inhabited by fearsome but lovable creatures known as the 'Wild Things.' Max tames them with a magic trick and becomes their king. 'Where the Wild Things Are' is a beautifully illustrated and emotionally resonant tale that acknowledges and validates a child's anger, ultimately providing a comforting return to the safety and love of home.",
    "coverImage": "9780060254926.jpg"
  },
  {
    "title": "Goodnight Moon",
    "author": "Margaret Wise Brown",
    "isbn": "9780060775858",
    "price": 8.99,
    "cost": 4.50,
    "stock": 70,
    "category": "Children's Books",
    "location": "H2",
    "publisher": "HarperCollins",
    "description": "A quintessential bedtime story, 'Goodnight Moon' is a gentle and soothing classic that has lulled generations of children to sleep. The simple, poetic text follows a little bunny as it says goodnight to everything in its 'great green room': the picture of the cow jumping over the moon, the three little bears sitting on chairs, the kittens, and the mittens. The illustrations by Clement Hurd gradually darken with each page turn, mirroring the setting sun and creating a calming atmosphere. The book's quiet rhythm and familiar ritual provide a sense of comfort and security, making it the perfect end-of-day read for young children.",
    "coverImage": "9780060775858.jpg"
  },
  {
    "title": "The Giving Tree",
    "author": "Shel Silverstein",
    "isbn": "9780060256654",
    "price": 17.99,
    "cost": 9.00,
    "stock": 52,
    "category": "Children's Books",
    "location": "H2",
    "publisher": "Harper & Row",
    "description": "Shel Silverstein's 'The Giving Tree' is a tender and poignant story about the gift of giving and the capacity for love. The book tells the story of a lifelong relationship between a boy and a tree. As the boy grows up, the tree gives him everything he asks for—her apples to sell, her branches to build a house, and her trunk to build a boat. The tree is happy to give, even as she is left with only a stump. This simple yet powerful allegory has been interpreted in many ways, exploring themes of unconditional love, self-sacrifice, and the relationship between humanity and nature. It remains a moving and thought-provoking tale for readers of all ages.",
    "coverImage": "9780060256654.jpg"
  },
  {
    "title": "Harry Potter and the Sorcerer's Stone",
    "author": "J.K. Rowling",
    "isbn": "9780590353427",
    "price": 24.99,
    "cost": 12.50,
    "stock": 80,
    "category": "Children's Books",
    "location": "H1",
    "publisher": "Scholastic Inc.",
    "description": "The book that started a global phenomenon, this is the story of Harry Potter, an orphaned boy who believes he is ordinary until he discovers on his eleventh birthday that he is a wizard. He is whisked away from his miserable life with his cruel aunt and uncle to attend Hogwarts School of Witchcraft and Wizardry. There, he makes new friends, learns about his magical heritage, and uncovers the truth about his parents' mysterious deaths. Harry finds himself on a collision course with the dark wizard who murdered his parents, Lord Voldemort, in a magical adventure that has captivated readers around the world.",
    "coverImage": "9780590353427.jpg"
  },
  {
    "title": "Introduction to Algorithms",
    "author": "Thomas H. Cormen",
    "isbn": "9780262033848",
    "price": 99.00,
    "cost": 55.00,
    "stock": 10,
    "category": "Computer Science",
    "location": "A4",
    "publisher": "The MIT Press",
    "description": "Often referred to as CLRS, this is the definitive and comprehensive textbook on algorithms for computer science students and professionals. The book covers a broad range of algorithms in depth, yet makes their design and analysis accessible to all levels of readers. Each chapter is relatively self-contained and presents an algorithm, a design technique, an application area, or a related topic. The algorithms are described in English and in a pseudocode designed to be readable by anyone who has done a little programming. It provides a rigorous and thorough treatment of sorting, data structures, graph algorithms, and much more, making it an essential reference.",
    "coverImage": "9780262033848.jpg"
  },
  {
    "title": "Structure and Interpretation of Computer Programs",
    "author": "Harold Abelson, Gerald Jay Sussman",
    "isbn": "9780262510875",
    "price": 75.00,
    "cost": 40.00,
    "stock": 7,
    "category": "Computer Science",
    "location": "A4",
    "publisher": "The MIT Press",
    "description": "A legendary computer science textbook from MIT, 'SICP' has had a profound influence on how programming is taught. The book focuses on the fundamental principles of programming, such as abstraction, recursion, and modularity, using the Scheme dialect of Lisp. It teaches readers to think about programming not just as a set of instructions, but as a way of organizing and controlling the complexity of computational systems. Rather than focusing on a specific language's syntax, it emphasizes deep concepts that are applicable across all programming languages, making it a challenging but deeply rewarding text for serious programmers.",
    "coverImage": "9780262510875.jpg"
  },
  {
    "title": "The C Programming Language",
    "author": "Brian W. Kernighan, Dennis M. Ritchie",
    "isbn": "9780131103627",
    "price": 65.00,
    "cost": 33.00,
    "stock": 25,
    "category": "Computer Science",
    "location": "A5",
    "publisher": "Prentice Hall",
    "description": "Affectionately known as 'K&R,' this is the classic and authoritative guide to the C programming language, written by its creators. The book is celebrated for its concise and clear style, providing a comprehensive tutorial and reference for C. It covers the language's core features, including types, operators, control flow, functions, pointers, and the standard library. The text is famous for its 'hello, world' example and its pragmatic approach to teaching programming. Despite its age, it remains an essential resource for anyone looking to understand the fundamentals of C and the principles of systems programming.",
    "coverImage": "9780131103627.jpg"
  },
  {
    "title": "Artificial Intelligence: A Modern Approach",
    "author": "Stuart Russell, Peter Norvig",
    "isbn": "9780136042594",
    "price": 120.00,
    "cost": 65.00,
    "stock": 6,
    "category": "Computer Science",
    "location": "A5",
    "publisher": "Pearson",
    "description": "The leading textbook in the field of Artificial Intelligence, this book provides the most comprehensive, up-to-date introduction to the theory and practice of AI. It is organized around the concept of intelligent agents—entities that perceive their environment and act to maximize their chances of success. The authors cover a vast range of topics, including search algorithms, knowledge representation, machine learning, natural language processing, robotics, and probabilistic reasoning. Its clear explanations and broad coverage make it an essential text for students and a valuable reference for researchers and professionals working in AI.",
    "coverImage": "9780136042594.jpg"
  },
  {
    "title": "Compilers: Principles, Techniques, and Tools",
    "author": "Alfred V. Aho",
    "isbn": "9780321486813",
    "price": 110.00,
    "cost": 60.00,
    "stock": 5,
    "category": "Computer Science",
    "location": "A4",
    "publisher": "Pearson",
    "description": "Famously known as the 'Dragon Book,' this is the classic and definitive textbook on compiler design. It provides a thorough introduction to the theory and practice of building compilers, covering all the major phases of the compilation process. The book details lexical analysis, syntax analysis (parsing), semantic analysis, intermediate code generation, code optimization, and code generation. It presents the underlying theory with clarity and provides practical examples and exercises. For anyone looking to understand how high-level programming languages are translated into machine code, the Dragon Book is the essential and authoritative guide.",
    "coverImage": "9780321486813.jpg"
  },
  {
    "title": "Computer Networks",
    "author": "Andrew S. Tanenbaum",
    "isbn": "9780132126953",
    "price": 95.00,
    "cost": 50.00,
    "stock": 11,
    "category": "Computer Science",
    "location": "A5",
    "publisher": "Pearson",
    "description": "A foundational textbook in the field of computer networking, this book offers a clear and comprehensive introduction to the principles and protocols that govern the internet and other computer networks. Using a top-down approach, it starts with the application layer and works its way down through the protocol stack (transport, network, link, and physical layers). The book covers a wide range of topics, including network architecture, data transmission, error detection, routing algorithms, and network security. Its engaging writing style and real-world examples make complex networking concepts understandable and accessible to students and professionals alike.",
    "coverImage": "9780132126953.jpg"
  },
  {
    "title": "The Sun Also Rises",
    "author": "Ernest Hemingway",
    "isbn": "9780743297331",
    "price": 17.00,
    "cost": 8.50,
    "stock": 18,
    "category": "Classic Literature",
    "location": "G3",
    "publisher": "Scribner",
    "description": "A landmark of modernist literature, Ernest Hemingway's 'The Sun Also Rises' captures the disillusionment and angst of the 'Lost Generation' after World War I. The novel follows a group of American and British expatriates as they travel from the lively cafes of Paris to the bullfighting festivals of Pamplona, Spain. Narrated by the journalist Jake Barnes, whose war injury has left him impotent, the story explores themes of love, loss, masculinity, and the search for meaning in a world stripped of its old certainties. Hemingway's spare, declarative prose and masterful use of subtext create a powerful and enduring portrait of a generation adrift.",
    "coverImage": "9780743297331.jpg"
  },
  {
    "title": "Pride and Prejudice",
    "author": "Jane Austen",
    "isbn": "9780141439518",
    "price": 14.00,
    "cost": 7.00,
    "stock": 32,
    "category": "Classic Literature",
    "location": "G3",
    "publisher": "Penguin Classics",
    "description": "Jane Austen's timeless novel is a witty and incisive comedy of manners set in early 19th-century England. It tells the story of the five Bennet sisters and their mother's desperate attempts to see them married. The spirited and intelligent protagonist, Elizabeth Bennet, clashes with the proud and wealthy Mr. Darcy. Their relationship is a captivating dance of misunderstanding, social prejudice, and eventual understanding. Through its memorable characters and sparkling dialogue, 'Pride and Prejudice' offers a brilliant satire of the social conventions, class structures, and marriage market of its time, while also being one of the most beloved love stories ever written.",
    "coverImage": "9780141439518.jpg"
  },
  {
    "title": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "isbn": "9780061120084",
    "price": 18.00,
    "cost": 9.00,
    "stock": 41,
    "category": "Classic Literature",
    "location": "G4",
    "publisher": "Harper Perennial Modern Classics",
    "description": "A cherished classic of American literature, 'To Kill a Mockingbird' is a powerful and moving story set in the racially charged atmosphere of the American South during the Great Depression. The novel is narrated by a young girl, Scout Finch, who observes her town's deep-seated prejudice and hypocrisy through the trial of a black man unjustly accused of a crime. Her father, the principled lawyer Atticus Finch, defends the man, teaching his children invaluable lessons about courage, compassion, and moral integrity. The book is a timeless exploration of innocence, injustice, and the complexities of human morality.",
    "coverImage": "9780061120084.jpg"
  },
  {
    "title": "1984",
    "author": "George Orwell",
    "isbn": "9780451524935",
    "price": 15.99,
    "cost": 8.00,
    "stock": 37,
    "category": "Classic Literature",
    "location": "G4",
    "publisher": "Signet Classics",
    "description": "George Orwell's dystopian masterpiece presents a chilling vision of a totalitarian future where the government, led by the omnipresent Big Brother, exercises absolute control over every aspect of human life. The story follows Winston Smith, a low-ranking member of the ruling Party who grows disillusioned with the constant surveillance, propaganda ('Newspeak'), and historical revisionism. He begins a forbidden affair and dares to dream of rebellion, but in a world where even independent thought ('thoughtcrime') is a punishable offense, his struggle for freedom seems doomed. '1984' is a powerful warning against the dangers of totalitarianism and the erosion of truth.",
    "coverImage": "9780451524935.jpg"
  },
  {
    "title": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "isbn": "9780743273565",
    "price": 16.00,
    "cost": 8.00,
    "stock": 29,
    "category": "Classic Literature",
    "location": "G3",
    "publisher": "Scribner",
    "description": "Set in the lavish and decadent world of the Roaring Twenties, 'The Great Gatsby' is a profound critique of the American Dream. The novel is narrated by Nick Carraway, a young Midwesterner who moves to Long Island and becomes entangled in the lives of his wealthy neighbors. He is particularly fascinated by the mysterious Jay Gatsby, a self-made millionaire who throws extravagant parties in the hope of winning back his long-lost love, Daisy Buchanan. Fitzgerald's lyrical prose and rich symbolism create a poignant and tragic story of obsession, wealth, and the illusion of the past.",
    "coverImage": "9780743273565.jpg"
  },
  {
    "title": "Moby Dick",
    "author": "Herman Melville",
    "isbn": "9780142437247",
    "price": 19.00,
    "cost": 9.50,
    "stock": 12,
    "category": "Classic Literature",
    "location": "G4",
    "publisher": "Penguin Classics",
    "description": "Herman Melville's 'Moby Dick' is an epic and ambitious novel of adventure, obsession, and metaphysics. The story is narrated by Ishmael, a sailor who joins the crew of the whaling ship Pequod. He soon discovers that the ship's enigmatic and tyrannical captain, Ahab, is not on a commercial voyage but on a mad quest for revenge against Moby Dick, the great white whale that took his leg. The novel is both a detailed, realistic account of 19th-century whaling and a profound symbolic exploration of themes like fate, free will, and the nature of good and evil. It is a monumental work of American literature.",
    "coverImage": "9780142437247.jpg"
  },
  {
    "title": "The Wasteland",
    "author": "T.S. Eliot",
    "isbn": "9780871407260",
    "price": 15.00,
    "cost": 7.50,
    "stock": 22,
    "category": "Poetry",
    "location": "F3",
    "publisher": "Liveright",
    "description": "One of the most important poems of the 20th century, T.S. Eliot's 'The Waste Land' is a complex and fragmented work that captures the disillusionment and cultural decay of the post-World War I era. The poem is structured in five sections and employs a wide range of voices, languages, and literary allusions, from Shakespeare and Dante to Hindu scriptures. It paints a bleak picture of a modern world that is spiritually barren and disconnected from its cultural heritage. The poem's innovative techniques and profound themes have made it a cornerstone of modernist literature, influencing generations of poets and writers.",
    "coverImage": "9780871407260.jpg"
  },
  {
    "title": "Leaves of Grass",
    "author": "Walt Whitman",
    "isbn": "9780553213511",
    "price": 13.00,
    "cost": 6.50,
    "stock": 26,
    "category": "Poetry",
    "location": "F3",
    "publisher": "Bantam Classics",
    "description": "Walt Whitman's 'Leaves of Grass' is a groundbreaking and quintessentially American collection of poetry. Whitman spent his entire life writing and rewriting this work, with the first edition published in 1855 and the final 'deathbed' edition in 1892. The collection celebrates democracy, nature, love, and the individual human spirit. Whitman's use of free verse and his inclusive, transcendental vision were revolutionary for their time. The central poem, 'Song of Myself,' is an epic celebration of the self and its connection to all of humanity and the cosmos. It is a foundational text of American literature.",
    "coverImage": "9780553213511.jpg"
  },
  {
    "title": "Ariel",
    "author": "Sylvia Plath",
    "isbn": "9780060931835",
    "price": 16.99,
    "cost": 8.50,
    "stock": 15,
    "category": "Poetry",
    "location": "F4",
    "publisher": "Harper Perennial Modern Classics",
    "description": "Published posthumously, 'Ariel' is the powerful and intense collection of poems that secured Sylvia Plath's legacy as one of the most important poets of the 20th century. The poems, many written in the final months of her life, are characterized by their raw emotional honesty, striking imagery, and technical brilliance. They explore themes of death, rage, love, and personal identity with a fierce and unflinching voice. Poems like 'Daddy' and 'Lady Lazarus' are landmarks of confessional poetry, showcasing Plath's ability to transform personal anguish into art of universal power and resonance.",
    "coverImage": "9780060931835.jpg"
  },
  {
    "title": "The Odyssey",
    "author": "Homer",
    "isbn": "9780140268867",
    "price": 18.00,
    "cost": 9.00,
    "stock": 30,
    "category": "Poetry",
    "location": "F4",
    "publisher": "Penguin Classics",
    "description": "An ancient Greek epic poem attributed to Homer, 'The Odyssey' is one of the foundational works of Western literature. It tells the story of Odysseus, the clever king of Ithaca, and his long and arduous ten-year journey home after the fall of Troy. Along the way, he must overcome a host of mythological challenges, including the cyclops Polyphemus, the sorceress Circe, and the deadly Sirens. Meanwhile, back in Ithaca, his wife Penelope and son Telemachus must contend with a group of arrogant suitors vying for Penelope's hand and Odysseus's throne. It is a timeless tale of adventure, perseverance, and the meaning of home.",
    "coverImage": "9780140268867.jpg"
  },
  {
    "title": "Milk and Honey",
    "author": "Rupi Kaur",
    "isbn": "9781449474256",
    "price": 14.99,
    "cost": 7.50,
    "stock": 55,
    "category": "Poetry",
    "location": "F3",
    "publisher": "Andrews McMeel Publishing",
    "description": "A collection of poetry and prose that has resonated with millions of readers, 'Milk and Honey' is a journey through the most bitter and sweet moments in life. Rupi Kaur's work is divided into four chapters, each dealing with a different kind of pain and a different kind of healing. The chapters explore themes of violence, abuse, love, loss, and femininity. Accompanied by her own simple yet evocative illustrations, Kaur's poetry is direct, accessible, and emotionally powerful. It is a book about survival, celebrating the strength and resilience of the human spirit, particularly from a female perspective.",
    "coverImage": "9781449474256.jpg"
  },
  {
    "title": "A Brief History of Time",
    "author": "Stephen Hawking",
    "isbn": "9780553380163",
    "price": 19.99,
    "cost": 10.00,
    "stock": 28,
    "category": "Science",
    "location": "J1",
    "publisher": "Bantam",
    "description": "In this landmark work of popular science, the brilliant theoretical physicist Stephen Hawking attempts to explain a range of subjects in cosmology, including the Big Bang, black holes, and string theory, to a nonspecialist audience. The book's goal is to give an overview of the universe's origin and fate. Hawking discusses the history of scientific thought on these topics and explains complex concepts with clarity and wit, avoiding technical mathematics. 'A Brief History of Time' became a bestseller and has introduced millions of readers to the fascinating and mysterious world of modern physics and the fundamental questions about our universe.",
    "coverImage": "9780553380163.jpg"
  },
  {
    "title": "Cosmos",
    "author": "Carl Sagan",
    "isbn": "9780345539434",
    "price": 22.00,
    "cost": 11.00,
    "stock": 24,
    "category": "Science",
    "location": "J1",
    "publisher": "Ballantine Books",
    "description": "Based on his iconic television series, Carl Sagan's 'Cosmos' is a breathtaking and poetic exploration of the universe and our place within it. Sagan skillfully weaves together the history of scientific discovery, the principles of astronomy, and philosophical reflections on the human quest for knowledge. He takes readers on a journey through 15 billion years of cosmic evolution, from the Big Bang to the exploration of distant galaxies, and delves into topics like the origins of life, the search for extraterrestrial intelligence, and the future of humanity. The book is a passionate and eloquent testament to the power of science to inspire wonder.",
    "coverImage": "9780345539434.jpg"
  },
  {
    "title": "The Selfish Gene",
    "author": "Richard Dawkins",
    "isbn": "9780199291151",
    "price": 18.99,
    "cost": 9.50,
    "stock": 18,
    "category": "Science",
    "location": "J2",
    "publisher": "Oxford University Press",
    "description": "A classic in evolutionary biology, Richard Dawkins's 'The Selfish Gene' presents a gene-centered view of evolution. The book argues that natural selection acts primarily at the level of the gene, not the individual or the species. From this perspective, organisms are seen as 'survival machines' or vehicles built by genes to propagate themselves. Dawkins uses this framework to explain a wide range of animal behaviors, including altruism, which seems paradoxical from an individual's point of view but makes sense if the goal is to ensure the survival of shared genes in relatives. It's a provocative and influential work that has shaped modern evolutionary thought.",
    "coverImage": "9780199291151.jpg"
  },
  {
    "title": "The Immortal Life of Henrietta Lacks",
    "author": "Rebecca Skloot",
    "isbn": "9781400052189",
    "price": 17.00,
    "cost": 8.50,
    "stock": 21,
    "category": "Science",
    "location": "J2",
    "publisher": "Crown Publishing Group",
    "description": "This remarkable book tells the story of Henrietta Lacks, a poor Southern tobacco farmer whose cancer cells—taken without her knowledge in 1951—became one of the most important tools in medicine. Known as HeLa cells, they were the first 'immortal' human cells grown in culture and have been used in countless scientific breakthroughs, from developing the polio vaccine to cancer research. Rebecca Skloot masterfully weaves together Henrietta's personal story, the scientific history of her cells, and the profound ethical questions surrounding tissue ownership and informed consent. It's a powerful and deeply moving story about science, race, and family.",
    "coverImage": "9781400052189.jpg"
  },
  {
    "title": "The Man Who Mistook His Wife for a Hat",
    "author": "Oliver Sacks",
    "isbn": "9780684853949",
    "price": 16.00,
    "cost": 8.00,
    "stock": 19,
    "category": "Science",
    "location": "J1",
    "publisher": "Touchstone",
    "description": "In this fascinating collection of clinical tales, neurologist Oliver Sacks explores the strange and wondrous world of his patients. The book details cases of individuals who have lost their memories, are unable to recognize common objects, or have other bizarre neurological disorders. Sacks writes with profound empathy and insight, treating his patients not as collections of symptoms but as full human beings struggling to navigate their altered realities. The title story concerns a man with visual agnosia who literally cannot distinguish his wife's head from his hat. It's a compassionate and compelling look into the mysteries of the human brain and mind.",
    "coverImage": "9780684853949.jpg"
  },
  {
    "title": "The Body Keeps the Score",
    "author": "Bessel van der Kolk",
    "isbn": "9780143127741",
    "price": 19.00,
    "cost": 9.50,
    "stock": 32,
    "category": "Psychology",
    "location": "E5",
    "publisher": "Penguin Books",
    "description": "Dr. Bessel van der Kolk, one of the world's foremost experts on trauma, offers a paradigm-shifting look at how traumatic stress affects the brain and body. The book explains that trauma is not just a memory stored in the mind but a physical imprint that reshapes the brain's wiring and the body's chemistry. Dr. van der Kolk explores innovative treatments that go beyond traditional talk therapy, including neurofeedback, mindfulness, and yoga, which can help survivors reactivate their innate sense of control and reclaim their lives. It's an essential guide for anyone seeking to understand and heal from the profound impact of trauma.",
    "coverImage": "9780143127741.jpg"
  },
  {
    "title": "Man's Search for Meaning",
    "author": "Viktor E. Frankl",
    "isbn": "9780807014271",
    "price": 15.00,
    "cost": 7.50,
    "stock": 40,
    "category": "Psychology",
    "location": "E5",
    "publisher": "Beacon Press",
    "description": "A profound and deeply moving book, 'Man's Search for Meaning' is both a memoir of psychiatrist Viktor Frankl's experiences in Nazi concentration camps and an introduction to his therapeutic philosophy, known as logotherapy. Frankl argues that the primary human drive is not pleasure but the pursuit of what we find meaningful. He observed that the prisoners who were most likely to survive were those who held on to a sense of purpose, a reason to live. The book is a timeless testament to the human ability to find meaning and hope even in the most horrific circumstances, and its lessons continue to inspire millions.",
    "coverImage": "9780807014271.jpg"
  },
  {
    "title": "Quiet: The Power of Introverts",
    "author": "Susan Cain",
    "isbn": "9780307352156",
    "price": 18.00,
    "cost": 9.00,
    "stock": 28,
    "category": "Psychology",
    "location": "E6",
    "publisher": "Crown Publishers",
    "description": "In a culture that often celebrates the 'Extrovert Ideal,' Susan Cain's 'Quiet' is a passionate and well-researched argument for the power and value of introverts. The book explores the psychological, biological, and cultural factors that shape introversion and extroversion. Cain highlights the significant contributions that introverts have made to society and challenges the prevailing bias against quiet and contemplation. She offers practical advice for introverts on how to thrive in a world designed for extroverts, covering topics like career choices, relationships, and parenting. It's an empowering and insightful book that has sparked a global conversation about temperament.",
    "coverImage": "9780307352156.jpg"
  },
  {
    "title": "Daring Greatly",
    "author": "Brené Brown",
    "isbn": "9781592408412",
    "price": 17.00,
    "cost": 8.50,
    "stock": 35,
    "category": "Psychology",
    "location": "E6",
    "publisher": "Avery",
    "description": "Based on over a decade of research, Brené Brown's 'Daring Greatly' dispels the cultural myth that vulnerability is a weakness. Instead, she argues that it is our most accurate measure of courage. The book explains that when we shut ourselves off from vulnerability, we also distance ourselves from the experiences that bring purpose and meaning to our lives, such as love, belonging, and joy. Brown provides a powerful vision for how we can transform the way we live, love, parent, and lead by embracing our imperfections and daring to show up and be seen. It's a call to step into the arena and live a more courageous, wholehearted life.",
    "coverImage": "9781592408412.jpg"
  },
  {
    "title": "Influence: The Psychology of Persuasion",
    "author": "Robert B. Cialdini",
    "isbn": "9780061241895",
    "price": 19.99,
    "cost": 10.00,
    "stock": 25,
    "category": "Psychology",
    "location": "E5",
    "publisher": "Harper Business",
    "description": "In this classic book on persuasion, renowned psychologist Robert Cialdini explains the science behind why people say 'yes.' Based on years of research into the psychology of compliance, he identifies six universal principles of influence: reciprocation, commitment and consistency, social proof, liking, authority, and scarcity. For each principle, Cialdini explains how it is used by 'compliance professionals'—from salespeople to marketers—to persuade us, often without our conscious awareness. The book provides valuable insights into our own decision-making processes and equips us with the knowledge to recognize and resist manipulative persuasion tactics.",
    "coverImage": "9780061241895.jpg"
  }
]